In [1]:
import pandas as pd

In [5]:
path = r"C:\Users\OEM\Desktop\Datascience details\py-master\py-master\ML\9_decision_tree\Exercise\titanic.csv"

In [6]:
titanic_df = pd.read_csv(path)

In [7]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
titanic_input_df = titanic_df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived'],axis=1)

In [12]:
titanic_input_df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [20]:
titanic_input_df.isnull().any()

Pclass    False
Sex       False
Age        True
Fare      False
dtype: bool

In [25]:
titanic_input_df.isna().sum()#number of null values in each column

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [27]:
len(titanic_input_df)#total number of rows

891

In [30]:
titanic_input_df=titanic_input_df.dropna()

In [31]:
titanic_input_df.isnull().any()

Pclass    False
Sex       False
Age       False
Fare      False
dtype: bool

In [33]:
##Convert categorical value to number value
from sklearn.preprocessing import LabelEncoder

In [34]:
le_Sex = LabelEncoder()

In [35]:
titanic_input_df['Sex_n'] = le_Sex.fit_transform(titanic_input_df['Sex'])

C:\AnacondaNew\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [41]:
titanic_input_df.head()
titanic_input_df=titanic_input_df.drop(['Sex'],axis=1)

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [51]:
titanic_df = titanic_df.dropna(subset=['Age'],axis=0)

In [ ]:
titanic_output_df = titanic_df['Survived']

In [55]:
len(titanic_output_df)

714

In [56]:
#split the data to training and test

from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split( titanic_input_df,titanic_output_df, test_size=0.2, random_state=1)

Implement Decision tree algorithm

In [57]:
from sklearn import tree

In [58]:
model=tree.DecisionTreeClassifier()

In [59]:
model.fit(X_train,Y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [61]:
Y_predict = model.predict(X_test)

In [62]:
from sklearn.metrics import accuracy_score
accuracy_score(Y_test,Y_predict)

0.8251748251748252

In [66]:
model1=tree.DecisionTreeClassifier(criterion='entropy')

In [67]:
model1.fit(X_train,Y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [68]:
Y_predict = model1.predict(X_test)

In [69]:
from sklearn.metrics import accuracy_score
accuracy_score(Y_test,Y_predict)

0.8321678321678322